# Задание 3- Напишите программу, которая принимает на вход координаты точки (X и Y), 
# причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, 
# в которой находится эта точка (или на какой оси она находится).

# Пример:

# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3

print()
print ('Введите координаты точки (X ≠ 0 и Y ≠ 0)')
coord_x=float (input ('X='))
coord_y=float (input ('Y='))
if (coord_x==0 or coord_y==0):
    print ('Будьте внимательнее (X ≠ 0 и Y ≠ 0)')
if (coord_x>0 and coord_y>0):
    print ('Точка находится в первой четверти')
if (coord_x<0 and coord_y>0):
    print ('Точка находится во второй четверти')
if (coord_x<0 and coord_y<0):
    print ('Точка находится в третьей четверти')
if (coord_x>0 and coord_y<0):
    print ('Точка находится в четвертой четверти')