# 1- Напишите программу, которая принимает на вход цифру, 
# обозначающую день недели, и проверяет, является ли этот день выходным.
# Дополнительно: можете проверить, что это действительно число, 
# и что это действительно входит в нужный диапазон

# *Пример:*

# - 6 -> да
# - 7 -> да
# - 1 -> нет

print()
number_week_day = input('Введите число - порядковый номер дня недели в диапазоне от 1 до 7: ')
try:
    number_week_day=int(number_week_day)
    print('Вы ввели число. Очень хорошо')
    if (1<number_week_day>7):
        print ('Но будьте внимательнее. Число должно быть в диапазоне от 1 до 7')
    elif (1<=number_week_day<=5):
        print ('НЕТ-РАБОТАЕМ')
    elif (6<=number_week_day<=7):
        print ('ДAAA!!!-ВЫХОДНОЙ')
except ValueError:
    print('Вы ввели не число. Давайте попробуем еще раз')




